error.invalidNumberOfParameters=\u0423\u043F\u0441, \u043D\u0435\u0432\u0435\u0440\u043D\u043E\u0435 \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u043E\u0432.
error.invalidParameters=\u0423\u043F\u0441, \u043D\u0435\u0432\u0435\u0440\u043D\u044B\u0435 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u044B.
error.unknownCommand=\u0423\u043F\u0441, \u043D\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u043D\u0430\u044F \u043A\u043E\u043C\u0430\u043D\u0434\u0430. \u041F\u043E\u043F\u0440\u043E\u0431\u0443\u0439\u0442\u0435 \u0435\u0449\u0435 \u0440\u0430\u0437.
error.error=\u041F\u0440\u043E\u0438\u0437\u043E\u0448\u043B\u0430 \u043E\u0448\u0438\u0431\u043A\u0430.
result=\u0420\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442:
menu.firstMessage=\u0412\u0432\u0435\u0434\u0438\u0442\u0435 'ru' - \u0434\u043B\u044F \u0420\u0443\u0441\u0441\u043A\u043E\u0433\u043E \u044F\u0437\u044B\u043A\u0430. \u0412\u0432\u0435\u0434\u0438\u0442\u0435 \u0447\u0442\u043E \u0443\u0433\u043E\u0434\u043D\u043E \u0434\u043B\u044F \u044F\u0437\u044B\u043A\u0430 \u043F\u043E \u0443\u043C\u043E\u043B\u0447\u0430\u043D\u0438\u044E (\u0410\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u0438\u0439).
menu.allCommandsMessage=\u0412\u0441\u0435 \u043A\u043E\u043C\u0430\u043D\u0434\u044B:
menu.chlang=chlang - \u0418\u0437\u043C\u0435\u043D\u0438\u0442\u044C \u044F\u0437\u044B\u043A.
menu.exit=exit - \u0412\u044B\u0445\u043E\u0434.
menu.help=\u0418\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 'help' \u0434\u043B\u044F \u043E\u0442\u043E\u0431\u0440\u0430\u0436\u0435\u043D\u0438\u044F \u0432\u0441\u0435\u0445 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u044B\u0445 \u043A\u043E\u043C\u0430\u043D\u0434.\n\u0427\u0442\u043E\u0431\u044B \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u0431\u043E\u043B\u044C\u0448\u0435 \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u0438 \u043E \u043A\u043E\u043C\u0430\u043D\u0434\u0435, \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435: help \u0438\u043C\u044F\u041A\u043E\u043C\u0430\u043D\u0434\u044B
help.chlang=\u0418\u0437\u043C\u0435\u043D\u044F\u0435\u0442 \u044F\u0437\u044B\u043A. \u041F\u0430\u0440\u0430\u043C\u0435\u0442\u0440 'lang' \u043C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C EN - \u0434\u043B\u044F \u0430\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u043E\u0433\u043E, RU - \u0434\u043B\u044F \u0440\u0443\u0441\u0441\u043A\u043E\u0433\u043E.\n\u0418\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435: chlang \u044F\u0437\u044B\u043A
help.exit=\u0412\u044B\u0445\u043E\u0434\u0438\u0442 \u0438\u0437 \u043F\u0440\u0438\u043B\u043E\u0436\u0435\u043D\u0438\u044F.
help.help=\u041F\u043E\u043A\u0430\u0437\u044B\u0432\u0430\u0435\u0442 \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u043A\u043E\u043C\u0430\u043D\u0434. \u0412\u0441\u0435 \u043A\u043E\u043C\u0430\u043D\u0434\u044B \u0438 \u043F\u0430\u0440\u0430\u043C\u0435\u0442\u0440\u044B \u043D\u0435 \u0447\u0443\u0432\u0441\u0442\u0432\u0438\u0442\u0435\u043B\u044C\u043D\u044B \u043A \u0440\u0435\u0433\u0438\u0441\u0442\u0440\u0443.\n\u0418\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u0435: help \u0438\u043C\u044F\u041A\u043E\u043C\u0430\u043D\u0434\u044B
help.error.unknownCommand=\u041D\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u043D\u0430\u044F \u043A\u043E\u043C\u0430\u043D\u0434\u0430: 
chlang.result=\u042F\u0437\u044B\u043A \u0438\u0437\u043C\u0435\u043D\u0435\u043D.
exit.shutdown=\u0412\u044B\u043A\u043B\u044E\u0447\u0435\u043D\u0438\u0435...
menu.sort=sort - \u041E\u0442\u0441\u043E\u0440\u0442\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u043C\u0430\u0441\u0441\u0438\u0432.
menu.matrix=matrix - \u0412\u044B\u043F\u043E\u043B\u043D\u0438\u0442\u044C \u0440\u0430\u0437\u043B\u0438\u0447\u043D\u044B\u0435 \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u0438 \u0441 \u043C\u0430\u0442\u0440\u0438\u0446\u0430\u043C\u0438.
help.sort=\u0421\u043E\u0440\u0442\u0438\u0440\u0443\u0435\u0442 \u043C\u0430\u0441\u0441\u0438\u0432\u044B. \u0414\u043E\u0441\u0442\u0443\u043F\u043D\u044B\u0435 \u043C\u0435\u0442\u043E\u0434\u044B \u0441\u043E\u0440\u0442\u0438\u0440\u043E\u0432\u043A\u0438 (sortMethod): bubble, shaker, selection, insertion, binary-insertion, binary-merge \u0438 shell.\n\
  \u041C\u0430\u0441\u0441\u0438\u0432 \u043C\u043E\u0436\u043D\u043E \u0441\u0447\u0438\u0442\u0430\u0442\u044C \u0438\u0437 \u0444\u0430\u0439\u043B\u0430.\n\
  \u0427\u0442\u043E\u0431\u044B \u0441\u0447\u0438\u0442\u0430\u0442\u044C \u044D\u043B\u0435\u043C\u0435\u043D\u0442\u044B \u043A\u0430\u043A \u0441\u0442\u0440\u043E\u043A\u0438 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 \u043E\u043F\u0446\u0438\u044E (option) '-f'.\n\
  \u0427\u0442\u043E\u0431\u044B \u0441\u0447\u0438\u0442\u0430\u0442\u044C \u044D\u043B\u0435\u043C\u0435\u043D\u0442\u044B \u043A\u0430\u043A \u0446\u0435\u043B\u043E\u0447\u0438\u0441\u043B\u0435\u043D\u043D\u044B\u0435 \u0446\u0438\u0444\u0440\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 \u043E\u043F\u0446\u0438\u044E (option) '-fi'.\n\
  Usage: sort sortMethod option \u043F\u0443\u0442\u044C\\\u0434\u043E\\\u0444\u0430\u0439\u043B\u0430\n\n\
  \u0412\u044B \u0442\u0430\u043A\u0436\u0435 \u043C\u043E\u0436\u0435\u0442\u0435 \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0441\u043B\u0443\u0447\u0430\u0439\u043D\u044B\u0439 \u043C\u0430\u0441\u0441\u0438\u0432 \u0438 \u043E\u0442\u0441\u043E\u0440\u0442\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0435\u0433\u043E.\n\
  Usage: sort sortMethod \u0440\u0430\u0437\u043C\u0435\u0440 \u043C\u0438\u043D\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043C\u0430\u043A\u0441\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435
help.matrix=\u0412\u044B\u043F\u043E\u043B\u043D\u044F\u0435\u0442 \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u0438 \u043D\u0430 \u043C\u0430\u0442\u0440\u0438\u0446\u0430\u043C\u0438. \u0414\u043E\u0441\u0442\u0443\u043F\u043D\u044B\u0435 \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u0438: multiply-matrix, multiply-coeff, add, subtract \u0438 transpose.\n\n\
  'multiply-matrix' \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u044F \u0441\u0447\u0438\u0442\u0430\u0435\u0442 \u043F\u0440\u043E\u0438\u0437\u0432\u0435\u0434\u0435\u043D\u0438\u0435 \u0434\u0432\u0443\u0445 \u043C\u0430\u0442\u0440\u0438\u0446.\n\
  \u0415\u0441\u043B\u0438 \u0432\u044B \u0445\u043E\u0442\u0438\u0442\u0435 \u0441\u0447\u0438\u0442\u0430\u0442\u044C \u043C\u0430\u0442\u0440\u0438\u0446\u0443 \u0438\u0437 \u0444\u0430\u0439\u043B\u0430 (\u0432 \u0444\u0430\u0439\u043B\u0435 \u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u0432\u0435 \u043C\u0430\u0442\u0440\u0438\u0446\u044B \u0434\u043B\u044F \u0443\u043C\u043D\u043E\u0436\u0435\u043D\u0438\u044F) \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435: matrix multiply-matrix \u043F\u0443\u0441\u0442\u044C/\u043A/\u0444\u0430\u0439\u043B\u0443\n\
  \u0415\u0441\u043B\u0438 \u0432\u044B \u0445\u043E\u0442\u0438\u0442\u0435 \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C 2 \u0441\u043B\u0443\u0447\u0430\u0439\u043D\u044B\u0435 \u043C\u0430\u0442\u0440\u0438\u0446\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435: matrix multiply-matrix NxM NxM \u043C\u0438\u043D\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043C\u0430\u043A\u0441\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435\n\
  \u0433\u0434\u0435 NxM \u044D\u0442\u043E \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u0441\u0442\u0440\u043E\u043A \u0438 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u043B\u0435\u0432\u043E\u0439 \u0438 \u043F\u0440\u0430\u0432\u043E\u0439 \u043C\u0430\u0442\u0440\u0438\u0446\u044B.\n\n\
  'multiply-coeff' \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u044F \u0441\u0447\u0438\u0442\u0430\u0435\u0442 \u043F\u0440\u043E\u0438\u0437\u0432\u0435\u0434\u0435\u043D\u0438\u0435 \u043A\u043E\u044D\u0444\u0444\u0438\u0446\u0438\u0435\u043D\u0442\u0430 \u0438 \u043C\u0430\u0442\u0440\u0438\u0446\u044B.\n\
  \u0415\u0441\u043B\u0438 \u0432\u044B \u0445\u043E\u0442\u0438\u0442\u0435 \u0441\u0447\u0438\u0442\u0430\u0442\u044C \u043C\u0430\u0442\u0440\u0438\u0446\u0443 \u0438\u0437 \u0444\u0430\u0439\u043B\u0430 (\u0432 \u0444\u0430\u0439\u043B\u0435 \u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C \u0442\u043E\u043B\u044C\u043A\u043E \u043E\u0434\u043D\u0430 \u043C\u0430\u0442\u0440\u0438\u0446\u0430 \u0434\u043B\u044F \u0443\u043C\u043D\u043E\u0436\u0435\u043D\u0438\u044F) \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435: matrix multiply-coeff \u043A\u043E\u044D\u0444\u0444\u0438\u0446\u0438\u0435\u043D\u0442 \u043F\u0443\u0441\u0442\u044C/\u043A/\u0444\u0430\u0439\u043B\u0443\n\
  \u0415\u0441\u043B\u0438 \u0432\u044B \u0445\u043E\u0442\u0438\u0442\u0435 \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0441\u043B\u0443\u0447\u0430\u0439\u043D\u0443\u044E \u043C\u0430\u0442\u0440\u0438\u0446\u0443 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435: matrix multiply-coeff \u043A\u043E\u044D\u0444\u0444\u0438\u0446\u0438\u0435\u043D\u0442 NxM \u043C\u0438\u043D\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043C\u0430\u043A\u0441\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435\n\
  \u0433\u0434\u0435 NxM \u044D\u0442\u043E \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u0441\u0442\u0440\u043E\u043A \u0438 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u043C\u0430\u0442\u0440\u0438\u0446\u044B.\n\n\
  'add' \u0438 'subtract' \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u0438 \u0441\u0447\u0438\u0442\u0430\u044E\u0442 \u0441\u0443\u043C\u043C\u0443 \u0438 \u0440\u0430\u0437\u043D\u043E\u0441\u0442\u044C \u0434\u0432\u0443\u0445 \u043C\u0430\u0442\u0440\u0438\u0446 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0435\u043D\u043D\u043E.\n\
  \u0415\u0441\u043B\u0438 \u0432\u044B \u0445\u043E\u0442\u0438\u0442\u0435 \u0441\u0447\u0438\u0442\u0430\u0442\u044C \u043C\u0430\u0442\u0440\u0438\u0446\u0443 \u0438\u0437 \u0444\u0430\u0439\u043B\u0430 (\u0432 \u0444\u0430\u0439\u043B\u0435 \u0434\u043E\u043B\u0436\u043D\u043E \u0431\u044B\u0442\u044C \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u0432\u0435 \u043C\u0430\u0442\u0440\u0438\u0446\u044B \u0434\u043B\u044F \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u0438) \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435: matrix add/subtract \u043F\u0443\u0441\u0442\u044C/\u043A/\u0444\u0430\u0439\u043B\u0443\n\
  \u0415\u0441\u043B\u0438 \u0432\u044B \u0445\u043E\u0442\u0438\u0442\u0435 \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C 2 \u0441\u043B\u0443\u0447\u0430\u0439\u043D\u044B\u0435 \u043C\u0430\u0442\u0440\u0438\u0446\u044B \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435: matrix add/subtract NxM NxM \u043C\u0438\u043D\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043C\u0430\u043A\u0441\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435\n\
  \u0433\u0434\u0435 NxM \u044D\u0442\u043E \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u0441\u0442\u0440\u043E\u043A \u0438 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u043B\u0435\u0432\u043E\u0439 \u0438 \u043F\u0440\u0430\u0432\u043E\u0439 \u043C\u0430\u0442\u0440\u0438\u0446\u044B.\n\n\
  'transpose' \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u044F \u0442\u0440\u0430\u043D\u0441\u043F\u043E\u043D\u0438\u0440\u0443\u0435\u0442 \u043C\u0430\u0442\u0440\u0438\u0446\u0443.\n\
  \u0412\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u043F\u0440\u043E\u0447\u0438\u0442\u0430\u0442\u044C \u043C\u0430\u0442\u0440\u0438\u0446\u044B \u0438\u0437 \u0444\u0430\u0439\u043B\u0430 (\u0432\u0441\u0435 \u043C\u0430\u0442\u0440\u0438\u0446\u044B \u0432 \u0444\u0430\u0439\u043B\u0435 \u0431\u0443\u0434\u0443\u0442 \u0442\u0440\u0430\u043D\u0441\u043F\u043E\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B). \u0414\u043B\u044F \u044D\u0442\u043E\u0433\u043E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435: matrix transpose \u043F\u0443\u0441\u0442\u044C/\u043A/\u0444\u0430\u0439\u043B\u0443\n\
  \u0415\u0441\u043B\u0438 \u0432\u044B \u0445\u043E\u0442\u0438\u0442\u0435 \u0441\u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C \u0441\u043B\u0443\u0447\u0430\u0439\u043D\u0443\u044E \u043C\u0430\u0442\u0440\u0438\u0446\u0443 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435: matrix transpose NxM \u043C\u0438\u043D\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043C\u0430\u043A\u0441\u0417\u043D\u0430\u0447\u0435\u043D\u0438\u0435\n\
  \u0433\u0434\u0435 NxM \u044D\u0442\u043E \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u0441\u0442\u0440\u043E\u043A \u0438 \u0441\u0442\u043E\u043B\u0431\u0446\u043E\u0432 \u043C\u0430\u0442\u0440\u0438\u0446\u044B.
sort.invalidSortingName=\u041D\u0435\u0442 \u0442\u0430\u043A\u043E\u0439 \u0441\u043E\u0440\u0442\u0438\u0440\u043E\u0432\u043A\u0438. \u0414\u043B\u044F \u0431\u043E\u043B\u044C\u0448\u0435\u0439 \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u0438 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435: help sort
sort.invalidOption=\u041D\u0435\u0442 \u0442\u0430\u043A\u043E\u0439 \u043E\u043F\u0446\u0438\u0438. \u0418\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 '-f' \u0438\u043B\u0438 '-fi' \u043E\u043F\u0446\u0438\u0438. \u0414\u043B\u044F \u0431\u043E\u043B\u044C\u0448\u0435\u0439 \u0438\u043D\u0444\u043E\u0440\u043C\u0430\u0446\u0438\u0438 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435: help sort
sort.unknownError=\u041D\u0435\u0438\u0437\u0432\u0435\u0441\u0442\u043D\u0430\u044F \u043E\u0448\u0438\u0431\u043A\u0430.
sort.ioException=\u041D\u0435 \u043C\u043E\u0436\u0435\u0442 \u043F\u0440\u043E\u0447\u0438\u0442\u0430\u0442\u044C \u0444\u0430\u0439\u043B. \u041F\u0440\u043E\u0432\u0435\u0440\u044C\u0442\u0435 \u043F\u0443\u0442\u044C \u0434\u043E \u0444\u0430\u0439\u043B\u0430.
sort.inputArray=\u041F\u0440\u043E\u0447\u0438\u0442\u0430\u043D\u043D\u044B\u0435 \u043C\u0430\u0441\u0441\u0438\u0432\u044B:
sort.generatedArray=\u0421\u043E\u0437\u0434\u0430\u043D\u043D\u044B\u0439 \u043C\u0430\u0441\u0441\u0438\u0432:
sort.invalidElements=\u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u043F\u0440\u0435\u043E\u0431\u0440\u0430\u0437\u043E\u0432\u0430\u0442\u044C \u044D\u043B\u0435\u043C\u0435\u043D\u0442\u044B \u0438\u0437 \u0444\u0430\u0439\u043B\u0430 \u0432 \u0446\u0435\u043B\u044B\u0435 \u0446\u0438\u0444\u0440\u044B.
sort.result=\u0420\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442 \u0441\u043E\u0440\u0442\u0438\u0440\u043E\u0432\u043A\u0438:
matrix.invalidOperationName=\u041D\u0435\u0432\u0435\u0440\u043D\u043E\u0435 \u0438\u043C\u044F \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u0438: 
matrix.leftMatrix=\u041B\u0435\u0432\u0430\u044F \u043C\u0430\u0442\u0440\u0438\u0446\u0430:
matrix.rightMatrix=\u041F\u0440\u0430\u0432\u0430\u044F \u043C\u0430\u0442\u0440\u0438\u0446\u0430:
matrix.inputMatrix=\u0418\u0441\u0445\u043E\u0434\u043D\u0430\u044F \u043C\u0430\u0442\u0440\u0438\u0446\u0430:
matrix.transposed=\u0422\u0440\u0430\u043D\u0441\u043F\u043E\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u0430\u044F:
